In [54]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn
from sklearn.metrics import r2_score,accuracy_score
from sklearn.model_selection import train_test_split
pd.set_option("max.columns",500)
pd.set_option("max.rows",50000000)

In [5]:
df_train=pd.read_csv("C:\\Users\\sunrise\\Desktop\\Analytics Vidhya\\Big Mart Sales Prediction\\train.csv")
df_test=pd.read_csv("C:\\Users\\sunrise\\Desktop\\Analytics Vidhya\\Big Mart Sales Prediction\\test.csv")

In [6]:
df_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [7]:
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [9]:
df=pd.concat([df_train,df_test],ignore_index=True)

In [10]:
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0
...,...,...,...,...,...,...,...,...,...,...,...,...
783662,1006036,P00118942,F,26-35,15,B,4+,1,8,NaN,NaN,NaN
783663,1006036,P00254642,F,26-35,15,B,4+,1,5,8.0,NaN,NaN
783664,1006036,P00031842,F,26-35,15,B,4+,1,1,5.0,12.0,NaN
783665,1006037,P00124742,F,46-50,1,C,4+,0,10,16.0,NaN,NaN
783666,1006039,P00316642,F,46-50,0,B,4+,1,4,5.0,NaN,NaN

In [11]:
print(df_train.shape,df_test.shape,df.shape)

(550068, 12) (233599, 11) (783667, 12)

In [12]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [13]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
dtype: int64

In [18]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
dtype: object

In [21]:
df["Product_Category_2"]=df["Product_Category_2"].fillna(df["Product_Category_2"].mean())

In [22]:
df["Product_Category_3"]=df["Product_Category_3"].fillna(df["Product_Category_3"].mean())

In [23]:
df["Purchase"]=df["Purchase"].fillna(df["Purchase"].mean())

In [24]:
df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].replace(to_replace='4+',value='4')

In [53]:
df["Age"]

0         17
1         17
2         17
3         17
4         55
          ..
783662    35
783663    35
783664    35
783665    50
783666    50
Name: Age, Length: 783667, dtype: object

In [37]:
df['Age'] = df['Age'].replace(['0-17','55+','26-35','46-50'],['17','55','35','50'])

In [44]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,17,10,0,2,0,3,9.844506,12.668605,8370.0
1,1000001,P00248942,0,17,10,0,2,0,1,6.000000,14.000000,15200.0
2,1000001,P00087842,0,17,10,0,2,0,12,9.844506,12.668605,1422.0
3,1000001,P00085442,0,17,10,0,2,0,12,14.000000,12.668605,1057.0
4,1000002,P00285442,1,55,16,2,4,0,8,9.844506,12.668605,7969.0

In [39]:
from sklearn.preprocessing import LabelEncoder

In [40]:
le=LabelEncoder()

In [41]:
le.fit(df["Gender"])
df["Gender"]=le.transform(df["Gender"])

In [43]:
le.fit(df["City_Category"])
df["City_Category"]=le.transform(df["City_Category"])

In [58]:
df['Age'] = df['Age'].replace(['51-55','36-45','18-25'],['53','40','22'])

In [59]:
User_ID=df["User_ID"]

In [60]:
Product_ID=df["Product_ID"]

In [50]:
df.drop(columns=["User_ID","Product_ID"],inplace=True)

In [68]:
y=df["Purchase"]

In [69]:
df.drop(columns=["Purchase"],inplace=True)

In [70]:
X=df

In [71]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.30, random_state=42)

In [72]:
from sklearn.linear_model import LinearRegression

In [73]:
model=LinearRegression()

In [74]:
model.fit(X_train,y_train)

LinearRegression()

In [101]:
Purchase=model.predict(X_test)

In [102]:
r2_score(y_test,Predict)

0.09215727694625564

In [104]:
#